docs/blogs/10-mobius-zh.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2026-07-10 Fri 16:59 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Mobius Injection：一条消息瘫痪AI基础设施？</title>
<meta name="author" content="Zi Liang (团长)" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="/css/styles.css" /> <link rel="stylesheet" type="text/css" href="/css/htmlize.css" /></head>
<body>
<div id="preamble" class="status">
<nav class="nav"> <a href="/index.html" class="button">Home</a> <a href="/about.html" class="button">About</a> <a href="/sitemap.html" class="button">Sitemaps</a> </nav> <hr>
</div>
<div id="content" class="content">
<h1 class="title">Mobius Injection：一条消息瘫痪AI基础设施？</h1>
<div id="outline-container-org781e17a" class="outline-2">
<h2 id="org781e17a"><span class="section-number-2">1.</span> 背景：Agent生态的新攻击面</h2>
<div class="outline-text-2" id="text-1">
<p>
随着AI Agent的兴起，Agent与Agent之间的通信变得越来越普遍。但这也打开了一个全新的攻击面——如果一个恶意Agent给另一个Agent发了一条精心构造的消息，会发生什么？
</p>
</div>
</div>
<div id="outline-container-org6f4fdfc" class="outline-2">
<h2 id="org6f4fdfc"><span class="section-number-2">2.</span> AbO-DDoS：Agent传播的分布式拒绝服务</h2>
<div class="outline-text-2" id="text-2">
<p>
我们提出了AbO-DDoS（Agent-borne DDoS），一种新型的分布式拒绝服务攻击。攻击者通过"莫比乌斯注入"（Mobius Injection）——一种递归结构、能不断自我触发的消息——让Agent网络中的所有节点陷入无限的资源消耗循环。
</p>

<p>
本质上，这利用了大模型的一个底层特性：在处理输入时，模型的计算量往往是输入的（超）线性函数。如果你能让输入在Agent之间循环传播并且每次都被"加工"得更复杂，你就可以在Agent网络中引发级联的资源耗尽。
</p>
</div>
</div>
<div id="outline-container-org9a4623c" class="outline-2">
<h2 id="org9a4623c"><span class="section-number-2">3.</span> 为什么叫"莫比乌斯注入"？</h2>
<div class="outline-text-2" id="text-3">
<p>
莫比乌斯带是一个没有起点和终点的单侧曲面。我们的注入消息类似——它没有"终止条件"，在Agent之间的传递中不断变形但永不停歇。
</p>
</div>
</div>
<div id="outline-container-org7226e64" class="outline-2">
<h2 id="org7226e64"><span class="section-number-2">4.</span> 论文信息</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li>标题: Can a Single Message Paralyze the AI Infrastructure? The Rise of AbO-DDoS Attacks through Targeted Mobius Injection</li>
<li>作者: Zi Liang, Ronghua Li, Yanyun Wang, Qingqing Ye, Haibo Hu</li>
<li>状态: Preprint 2026</li>
<li>代码: <a href="https://github.com/liangzid/MobiusInjection">https://github.com/liangzid/MobiusInjection</a></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<hr class="Solid"> <div class="info"> <span class="author">Author: Zi Liang (团长) (<a href="mailto:liangzi20163933@qq.com">liangzi20163933@qq.com</a>)</span> <span class="date">Create Date: 2026-05-27</span> <span class="date">Last modified: 2026-05-27 Wed 21:41</span> <span>Creator: <a href="https://www.gnu.org/software/emacs/">Emacs</a> 31.0.90 (<a href="https://orgmode.org">Org</a> mode 9.8.5)</span> </div>
</div>
</body>
</html>
